{"product_detail": ["Avatar: The Way of Water (product_type: movie): Action, Adventure, Fantasy; Directed by James Cameron; Starring Sam Worthington, Zoe Saldana, Sigourney Weaver, Stephen Lang; IMDB Score: 7.8", "The Menu (product_type: movie): Horror, Thriller, Exclusive restaurant, Shocking surprises, Remote island", "Babylon (product_type: movie): Comedy, Drama, History; Directed by Damien Chazelle; Starring Brad Pitt, Margot Robbie, Jean Smart, Olivia Wilde; IMDB Score: 7.5", "Everything Everywhere All at Once (product_type: movie): Action, Adventure, Comedy; 139 min; IMDB Score: 8.0; Plot Summary: A middle-aged Chinese immigrant is swept up into an insane adventure in which she alone can save existence by exploring other universes and connecting with the lives she could have led.", "M3GAN (product_type: movie): Horror, Sci-Fi, Thriller, Robotics, Life-like doll", "The Banshees of Inisherin (product_type: movie): Comedy, Drama, Colin Farrell, Brendan Gleeson, Martin McDonagh", "Puss in Boots: The Last Wish (product_type: movie): Animation, Adventure, Comedy, PG, 102 min", "The Pale Blue Eye (product_type: movie): Crime, Horror, Mystery; Directed by Scott Cooper; Starring Christian Bale", "Triangle of Sadness (product_type: movie): Comedy, Drama, Fashion model celebrity couple, Eventful cruise, Super-rich", "Glass Onion (product_type: movie): Comedy, Crime, Drama; PG-13; 139 min; 7.2 IMDB Score; 81 Metascore", "The Whale (product_type: movie): Drama, Reconnecting with estranged daughter, Morbidly obese English teacher", "The Fabelmans (product_type: movie): Drama, Coming-of-age, Family secret, Filmmaking, Post-World War II era", "Tár (product_type: movie): Drama, Music, Female director, Classical music, Great performances", "Shotgun Wedding (product_type: movie): Action, Comedy, Romance, Destination Wedding, Hostage Situation", "All Quiet on the Western Front (product_type: movie): Action, Drama, War; 148 min; IMDB Score: 7.8; Plot Summary: A young German soldier's terrifying experiences and distress on the western front during World War I.", "A Man Called Otto (product_type: movie): Comedy, Drama, Tom Hanks, Mariana Treviño, Rachel Keller", "Aftersun (product_type: movie): Drama, Reflective, Father-Daughter Relationship, Memories, Reconciliation", "Top Gun: Maverick (product_type: movie): Action, Drama, Top Naval Aviator, Elite Graduates, Ultimate Sacrifice", "Narvik: Hitler's First Defeat (product_type: movie): Drama, History, War, April 1940, Narvik", "Women Talking (product_type: movie): Drama, 2010, Religious community, Faith, Isolation", "X (product_type: movie): Horror, Mystery, Thriller, 1979, Texas", "Bullet Train (product_type: movie): Action, Comedy, Thriller; Directed by David Leitch; Starring Brad Pitt, Joey King, Aaron Taylor-Johnson, Brian Tyree Henry; IMDB Score: 7.3", "Elvis (product_type: movie): Biography, Drama, Music; 159 min; PG-13; Tom Hanks; Austin Butler", "Devotion (product_type: movie): Action, Drama, War; 139 min; PG-13; IMDB Score: 6.7; Plot Summary: A pair of U.S. Navy fighter pilots risk their lives during the Korean War and become some of the Navy's most celebrated wingmen.", "To Leslie (product_type: movie): Drama, Inspired by True events, Redemption, Single mother, Lottery", "Vengeance (product_type: movie): Comedy, Mystery, Thriller; 107 min; R-rated; Directed by B.J. Novak; Starring B.J. Novak, Boyd Holbrook, Lio Tipton, Ashton Kutcher", "Amsterdam (product_type: movie): Comedy, Drama, History; Directed by David O. Russell; Starring Christian Bale, Margot Robbie, John David Washington; Plot Summary: In the 1930s, three friends witness a murder, are framed for it, and uncover one of the most outrageous plots in American history.", "RRR (product_type: movie): Action, Adventure, Drama; 187 min; 7.9 IMDB Score; Directed by S.S. Rajamouli; Starring N.T. Rama Rao Jr., Ram Charan Teja, Ajay Devgn, Alia Bhatt", "Black Panther: Wakanda Forever (product_type: movie): Action, Adventure, Drama; Directed by Ryan Coogler; Starring Letitia Wright, Lupita Nyong'o, Danai Gurira, Winston Duke; IMDB Score: 7.1", "Violent Night (product_type: movie): Action, Comedy, Crime, Santa Claus, Christmas", "The Batman (product_type: movie): Action, Crime, Drama; Directed by Matt Reeves; Starring Robert Pattinson, Zoë Kravitz, Jeffrey Wright, Colin Farrell; IMDB Score: 7.8", "Vesper (product_type: movie): Adventure, Drama, Sci-Fi; 13-year-old protagonist; Bio-hacking abilities; Struggle for the future; Collapse of Earth's ecosystem", "Parable of the Sower (product_type: book): Science Fiction, Historical Fiction, 368 pages, Paperback, Octavia E Butler", "An Immense World: How Animal Senses Reveal the Hidden Realms Around Us (product_type: book): Immense World, Animal Senses, Hidden Realms, 464 pages, Hardcover", "Invisible Storm: A Soldier's Memoir of Politics and Ptsd (product_type: book): Memoir, Politics, PTSD, Hardcover, Jason Kander", "Tomorrow, and Tomorrow, and Tomorrow (product_type: book): Action & Adventure, Literary, Romance - Contemporary, Hardcover, Gabrielle Zevin", "Tanqueray (product_type: book): Personal Memoirs, Street Photography, Hardcover, Authors: Stephanie Johnson, Brandon Stanton", "No More Police: A Case for Abolition (product_type: book): No More Police, Abolition, Law Enforcement, Discrimination & Race Relations, Violence in Society", "The Metaverse: And How It Will Revolutionize Everything (product_type: book): Metaverse, Revolutionize, Philosophy, Social Aspects, Technology Studies", "The Carbon Almanac: It's Not Too Late (product_type: book): Environmental Economics, Global Warming & Climate Change, Paperback, 352 pages, Published by Portfolio", "Book Lovers (product_type: book): Romance, Romantic Comedy, Women, Paperback, Emily Henry", "Night of the Living Rez (product_type: book): Short Stories, Family Life, Paperback, Author: Morgan Talty, Publisher: Tin House Books", "Allow Me to Retort: A Black Guy's Guide to the Constitution (product_type: book): Commentary & Opinion, Constitutional, Essays, Hardcover, Author: Elie Mystal, Published by New Press", "The Seven Husbands of Evelyn Hugo (product_type: book): Women, Family Life, Romance, Paperback, Taylor Jenkins Reid", "Financial Feminist: Overcome the Patriarchy's Bullsh*t to Master Your Money and Build a Life You Love (product_type: book): Financial Feminist, Overcome Patriarchy, Master Money, Build Life You Love", "Where the Crawdads Sing (product_type: book): Coming of Age, Women, Paperback, Delia Owens, G.P. Putnam's Sons", "Crying in H Mart: A Memoir (product_type: book): Memoir, Cultural, Essays, Death, Hardcover", "Thank You for Your Servitude: Donald Trump's Washington and the Price of Submission (product_type: book): Political Process, American Government, Corruption & Misconduct, Hardcover, Mark Leibovich", "Parable of the Talents (product_type: book): Dystopian, Women, Paperback, Octavia E Butler, Grand Central Publishing", "A Prayer for the Crown-Shy: A Monk and Robot Book (product_type: book): Science Fiction, Action & Adventure, Apocalyptic & Post-Apocalyptic, Hardcover, Becky Chambers", "Stay Curious and Keep Exploring: 50 Amazing, Bubbly, and Colorful Science Experiments to Do with the Whole Family (product_type: book): 50 science experiments, Family-friendly, Colorful illustrations, Hardcover, Written by Emily Calandrelli", "You Made a Fool of Death with Your Beauty (product_type: book): Romance, Contemporary, Women, African American, Hardcover", "Verity (product_type: book): Romance, Thriller, Paperback, Colleen Hoover, Grand Central Publishing", "Sea of Tranquility (product_type: book): Literary, Science Fiction, Apocalyptic, Post-Apocalyptic, Hardcover", "How the Word Is Passed: A Reckoning with the History of Slavery Across America (product_type: book): History of Slavery, United States, African American, Ethnic Studies, Hardcover", "Horse (product_type: book): Historical, Animals, Civil War Era, Hardcover, Geraldine Brooks", "Crucial Conversations: Tools for Talking When Stakes Are High (product_type: book): Crucial Conversations, Tools for Talking, High Stakes, Business Communication, Decision Making", "The 1619 Project: A New Origin Story (product_type: book): United States history, African American history, Ethnic studies, Hardcover, Published by One World", "Dare to Lead: Brave Work. Tough Conversations. Whole Hearts. (product_type: book): Leadership, Social Psychology, Personal Growth, Hardcover, Brené Brown", "What We Owe the Future (product_type: book): Ethics & Moral Philosophy, Good & Evil, Movements - Utilitarianism, History & Theory - General, Future Studies", "Be Not Afraid of Love: Lessons on Fear, Intimacy, and Connection (product_type: book): Lessons on Fear, Intimacy, Connection, Personal Growth, Self-Esteem", "Emergent Strategy: Shaping Change, Changing Worlds (product_type: book): Emergent Strategy, Shaping Change, Changing Worlds, Political Ideologies, Feminism, Paperback", "The Dawn of Everything: A New History of Humanity (product_type: book): New History, 704 pages, Civilization, Anthropology, Social History, Hardcover", "On Earth We're Briefly Gorgeous (product_type: book): Literary, Cultural Heritage, LGBT - General, Hardcover, Ocean Vuong", "What If? 2: Additional Serious Scientific Answers to Absurd Hypothetical Questions (product_type: book): Additional Serious Scientific Answers, Absurd Hypothetical Questions, Trivia, Physics, Essays", "Year of the Tiger: An Activist's Life (product_type: book): Activist's Life, 400 pages, Cultural & Ethnic, Social Activists, People with Disabilities", "Nightcrawling (product_type: book): Title, Price, Number of pages, Categories, Cover type", "Fight Like Hell: The Untold History of American Labor (product_type: book): American labor history, Social classes, Economic disparity, Labor unions, Hardcover", "The House in the Cerulean Sea (product_type: book): Fantasy, Contemporary, Humorous, LGBT, Gay", "Rogues: True Stories of Grifters, Killers, Rebels and Crooks (product_type: book): True Stories, Grifters, Killers, Rebels, Crooks", "Hope in the Dark: Untold Histories, Wild Possibilities (Updated) (product_type: book): Updated edition, 184 pages, Political ideologies, General history, Paperback cover", "Lapvona (product_type: book): Fantasy, Historical, Literary, Psychological, Hardcover", "See No Stranger: A Memoir and Manifesto of Revolutionary Love (product_type: book): Memoir, Manifesto, Revolutionary Love, Personal Growth, Discrimination & Race Relations", "Nevada (product_type: book): Literary, LGBT - Transgender, Paperback, Imogen Binnie, MCD X Fsg Originals", "What Moves the Dead (product_type: book): Horror, Occult & Supernatural, Hardcover, T. Kingfisher, Tor Nightfire", "This Time Tomorrow (product_type: book): Science Fiction, Time Travel, Women, Family Life, Hardcover", "How to Be an Antiracist (product_type: book): Personal Memoirs, Discrimination & Race Relations, Race & Ethnic Relations, Hardcover, Ibram X. Kendi, One World", "Smitten Kitchen Keepers: New Classics for Your Forever Files: A Cookbook (product_type: cookbook): New Classics, Regional & Ethnic Recipes, Dessert Recipes, Vegetable Recipes, Hardcover", "Abolition Geography: Essays Towards Liberation (product_type: book): Essays, Liberation, History, Geography, Discrimination", "Atlas of the Heart: Mapping Meaningful Connection and the Language of Human Experience (product_type: book): Atlas of the Heart, Mapping Meaningful Connection, Language of Human Experience, Personal Success, Social Psychology", "Patriarchy Blues: Reflections on Manhood (product_type: book): Reflections on Manhood, Cultural, Ethnic & Regional - African American & Black, Essays, Men's Studies, Paperback", "Nona the Ninth (product_type: book): Science Fiction, Fantasy, Action & Adventure, Epic, Space Opera", "TCL 30XL Unlocked Cell Phone (product_type: cell phone): 6.82 inch Display, 5000mAh Battery, 50MP Rear Camera, 13MP Front Camera, Dual Speaker", "UMIDIGI G3 MAX (product_type: smartphone): 8+128GB, 50MP Ultra-Clear AI Camera, 6.6-inch FHD Display, 5150mAh Massive Battery, Expandable Up to 1TB", "Google Pixel 6a (product_type: smartphone): 5G, 12 Megapixel Camera, 24-Hour Battery, Unlocked, Android", "TCL 30 SE (product_type: smartphone): 6.52'' display, 50MP camera, 5000mAh battery, 4+64GB storage, unlocked", "Motorola Moto G Stylus (product_type: smartphone): 2022, 2-Day battery, Unlocked, 6/128GB, 50MP Camera", "Samsung Galaxy S21 (product_type: smartphone): 5G, Factory Unlocked, Pro-Grade Camera, 8K Video, 64MP High Res", "TCL ION V (product_type: cell phone): 6.0'' HD+ Display, 3+32GB Unlocked Phone, 3000mAh Battery, Android 13 Smartphone, Single SIM", "OnePlus Nord N30 5G (product_type: smartphone): Unlocked, 5G, 6.7 LCD Display, 8 +128GB, 5000 mAh Battery", "Samsung Galaxy S20+ (product_type: smartphone): 5G, 128GB, Fully Unlocked", "OnePlus Nord N200 (product_type: smartphone): Large 5000mAh Battery, 5G Unlocked, 64GB Storage, 6.49'' Full HD+LCD Screen, Triple Camera", "Samsung Galaxy A13 5G Cell Phone (product_type: cell phone): AT&T GSM Unlocked, Long Lasting Battery, Expandable Storage, Triple Lens Camera, Infinite Display", "TCL 40XL (product_type: smartphone): Unlocked, 4GB RAM, 128GB storage, 6.75'' 90Hz display, 50MP AI camera", "TCL ION V (product_type: cell phone): 6.0'' HD+ Display, 3+32GB Unlocked Phone, 3000mAh Battery, Android 13 Smartphone, Single SIM", "SAMSUNG Galaxy A54 5G (product_type: smartphone): 5G, 128GB storage, 6.4'' Fluid Display Screen, Hi Res Camera, Long Battery Life", "OnePlus Nord N30 5G (product_type: smartphone): Unlocked, 5G, 6.7 LCD Display, 8 +128GB, 5000 mAh Battery", "Motorola Moto G Stylus 5G (product_type: smartphone): 5G, 6/256GB, 50MP Camera, Unlocked, Stylus", "Galaxy Z Flip 5 Cell Phone (product_type: cell phone): Factory Unlocked, Foldable Design, Full Cover Screen, 512GB, US Version", "TCL 10L (product_type: smartphone): Unlocked, 256GB+6GB RAM, 6.53'' FHD Display, 48MP Quad Rear Camera, 4000mAh Battery", "TCL 10 Plus Unlocked Smartphone (product_type: smartphone): 6.47'' Curved AMOLED FHD+ Display, 48MP Rear AI Quad-Camera, 4500mAh Fast Charging Battery, OTG Reverse Charging, Starlight Silver", " Mission: Impossible - Dead Reckoning Part One  (product_type: movie): Action, Thriller, Espionage, IMF, Dangerous Weapon", "Sound of Freedom (product_type: movie): True story, Government agent turned vigilante, Rescue mission, Sex traffickers, Alejandro Monteverde", "Oppenheimer (product_type: movie): Biography, Historical, Drama, Science, Christopher Nolan", "Barbie (product_type: movie): PG-13, 1h 54m, Directed by Greta Gerwig", "The Out-Laws (product_type: movie): Bank manager, Ghost Bandits, Wedding week, Future in-laws, Out-Laws", "Indiana Jones and the Dial of Destiny (product_type: movie): Archaeology, Adventure, Time-sensitive, Legendary artifact, Historical significance", "Wonka (product_type: movie): Napoleon Bonaparte's origins, ruthless climb to emperor, addictive relationship with Josephine, directed by Ridley Scott, written by David Scarpa"], "product_type_set": ["book", "cell phone", "movie", "smartphone", "cookbook"], "product_type": ["movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "movie", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "book", "cookbook", "book", "book", "book", "book", "cell phone", "smartphone", "smartphone", "smartphone", "smartphone", "smartphone", "cell phone", "smartphone", "smartphone", "smartphone", "cell phone", "smartphone", "cell phone", "smartphone", "smartphone", "smartphone", "cell phone", "smartphone", "smartphone", "movie", "movie", "movie", "movie", "movie", "movie", "movie"]}